{
    "0": {
        "name": [
            "Innovate for Competitive Advantage"
        ],
        "description": "Innovation is a key element of future readiness It is essential to preserving and expanding US military competitive advantage in the face of nearpeer competition and asymmetric threats A theme running through the National Defense Strategyand subordinate strategies like the Artificial Intelligence Strategyis that preserving and expanding our military advantage depends on our ability to deliver technology faster than our adversaries and the agility of our enterprise to adapt our way of fighting to the potential advantages of innovative technology The Department will evaluate opportunities for innovation pursuing those deemed most suitable to address military problems and including those likely to deliver leapahead capabilities Cloud and cognitive computing will significantly alter warfighting and defense business operations Recognizing this the Department established the Joint Artificial Intelligence Center JAIC to accelerate delivery of AIenabled capabilities and is partnering with industry to securely deliver commercial cloud capabilities in alignment with mission requirements Modernization of warfighter support systems will enable improved command and control C2 information sharing and decision support through a rich and diverse set of analytic capabilities fueled by data from sensors across the DoD Information Network DODIN Modernization of the Defense Information Systems Network DISN a key component of the DODIN will provide critical enhancements necessary to fully realize the benefits from cloud computing big data analytics mobility Internet of Things IoT increased automation and cognitive computing Increased availability and use of secure mobile wireless platforms across the Department will increase Joint Force maneuver accuracy and information advantage Additionally DoD will improve the efficiency and effectiveness of healthcare logistics and other warfighting support functions Enhanced delivery and protection of Positioning Navigation and Timing PNT and development of a resilient secure and adaptive tactical IT infrastructure will improve the Joint Forces ability to operate in denied degraded contested congested and operationally limited environments Central to many of these areas for innovation is software which was highlighted in Sections 872875 of the National Defense Authorization Act NDAA for FY2018 and the DoD 2018 Digital Engineering Strategy Effectively managing the cost and speed of integration for software delivery across the DoD is critical Additionally continued innovation in automating the software lifecycle beyond the current state of the practice will be required",
        "objectives": {
            "0": {
                "name": "Objective 1: Establish the Joint Artificial Intelligence Center (JAIC) to Accelerate Adoption and Integration of AI-Enabled Capabilities to Achieve Mission Impact at Scale Objective Description",
                "description": "The commercial sector is in the midst of a revolution in AI that is reshaping business and society. The 2018 NDS highlights that AI will change society and, ultimately, the character of war. The JAIC will accelerate DoDs adoption and integration of AI capabilities at speed and scale. It will operationalize AI capabilities by overcoming policy, technical, and financial roadblocks that prevent enterprise-level deployment, and by leveraging the capabilities established through DISN modernization (as described in Goal 1, Objective 8). The JAIC will collaborate with DoD Components (e.g. OUSD(R&E), OUSD(I), MILDEPS, Combatant Commands) to synchronize DoD-wide AI activities to enhance operational effectiveness and lethality, and increase efficiency of back-office business functions. Strategy Elements:  Strategy Element #1: Stand Up the JAIC and Initiate Operations  Strategy Element #2: Establish Partnerships with Industry, Academia, and Partner Nations to Ensure State-of-the-Art AI Capabilities  Strategy Element #3: Develop and Sustain the Enterprise Infrastructure Technology Stack that Enables AI Capability Deployment at Speed and Scale (JAIC Common Foundation)  Strategy Element #4: Lead DoD in AI Planning, Policy, Oversight, Ethics, and Safety  Strategy Element #5: Deliver AI-Enabled Capabilities to Address Key Missions (National Mission Initiatives, Component Mission Initiatives, and Smart Automation Initiatives)  Strategy Element #6: Assure /Certify the AI Algorithms, Data, and Models Developed for JAIC Implementations"
            },
            "1": {
                "name": "Objective 2: Deliver a DoD Enterprise Cloud Environment to Leverage Commercial Innovation Objective Description",
                "description": "The advent of commercial cloud capabilities is changing the way DoD develops, delivers, deploys, and ultimately, buys applications, systems, and services. Cloud is the foundation upon which DoD will build and scale more effective cybersecurity, advanced analytical capabilities, better command and control, and future enabling technologies. This foundation will enable the Department to organize massive amounts of data and support rapid access to information for improved decision-making, preserving and extending our military advantage. To better take advantage of this information, the optimized enterprise cloud environment will also provide a platform for advanced capabilities such as machine learning (ML) and AI that are necessary to increase decision-making quality, speed, and lethality. DoD will partner with industry to securely deliver commercial cloud capabilities in alignment with mission requirements and will manage these capabilities across the enterprise, to include the tactical edge (e.g., Denied, Degraded, Intermittent or Limited-bandwidth (D-DIL) environments), for improved effectiveness and efficiency. DoD CIO will collaborate with DoD Components (e.g., OUSD(R&E), MILDEPS, Combatant Commands) to support achievement of this objective. Strategy Elements:  Strategy Element #1: Deliver a General-Purpose Enterprise Cloud for Compute and Store Capabilities (i.e., Joint Enterprise Defense Infrastructure (JEDI))  Strategy Element #2: Identify Common Niche Capabilities to Inform the Creation of Fit for Purpose (F2P) Cloud Environments  Strategy Element #3: Provide a DoD On Premise Cloud Environment  Strategy Element #4: Establish an Enterprise Cloud Office to Enable Rapid Acquisition, Deployment, and Migration to Cloud Capabilities  Strategy Element #5: Manage the DoD Portfolio of Cloud Capabilities  Strategy Element #6: Develop Policy and Guidance to Modernize Application Development (e.g., Lean-Agile Practices)  Strategy Element #7: Develop and Deploy a DevSecOps Environment that Enables Application Development and Accreditation at Speed and Scale Integrated with Defensive Cyberspace Operations  Strategy Element #8: Develop Policy and Guidance on the Effective Application of DevSecOps Principles  Strategy Element #9: Enable Resilient Operation of DoD Functions on Commercial Cloud Infrastructure"
            },
            "2": {
                "name": "Objective 3: Modernize Warfighter Command",
                "description": "Control, Communications, and Computer (C4) Infrastructure and Systems Objective Description: Guide DoD investment to modernize Joint/Allied/Coalition C4 capabilities that support and enable the Joint warfighter. In collaboration with DoD Components (e.g., OUSD(R&E), MILDEPS, Combatant Commands), outline the way ahead for future development, implementation, fielding, and sustainment of strategic and tactical C2 and communications systems. Ensure that solutions are operationally effective in D-DIL circumstances. Strategy Elements:  Strategy Element #1: Produce C4 Strategies, Roadmaps, Plans, and Architectures  Strategy Element #2: Update and Publish Required Tactical Communications Policies  Strategy Element #3: Synchronize Enterprise C4 Capabilities through Effective Governance  Strategy Element #4: Modernize Tactical Radios and DoD Tactical Waveform Capabilities  Strategy Element #5: Develop and Maintain the Enterprise Architecture for DoD Public Safety Communications  Strategy Element #6: Implement DoD Global Enterprise Mass Warning & Notification (EMWN) Capabilities  Strategy Element #7: Modernize the Global Command and Control System - Joint (GCCS-J)  Strategy Element #8: Modernize DoD Satellite Communications Management and Control  Strategy Element #9: Execute the Satellite Communications (SATCOM) Modernization Activities Driven by the Protected Satellite Communications Services (PSCS) Analysis of Alternatives (AoA), the Wideband Communications Services (WCS) AoA, and the Impending Narrowband Satellite Communications AoA  Strategy Element #10: Formalize and Implement the Enterprise SATCOM Management and Control Reference Architecture"
            },
            "3": {
                "name": "Objective 4: Treat Data as a Strategic Asset Objective Description",
                "description": "The full benefits of decision-making, information sharing, cloud migration, AI, and other DoD objectives stated in this strategy are dependent upon DoDs data being visible, accessible, understandable, trusted, and interoperable as prescribed by DoD Instruction (DoDI) 8320.07. Data owners and their communities of interest (e.g., financial, logistics, healthcare, human resources, cybersecurity, records management) are responsible for much of the necessary work. However, essential infrastructure (e.g., IT services registry, meta data registry, authoritative data source registry) and defined, standardized data tags or labels do not currently exist. Additionally, the Department has no enterprise search capability to enable discovery of critical DoD data across its network security domains. DoD CIO is collaborating with the DoD CMO and Joint Staff on initiatives to support this objective. Joint Staff is driving development of data standards supporting interoperability. Separately, the FY2018 NDAA established a comprehensive and detailed set of Congressional expectations for the DoD CMO with respect to the treatment of data, summarized as follows: 1) Establish policy and governance for Common Enterprise Data related to business operations and management; 2) Conduct pilot programs to extract this data from relevant systems; 3) Analyze that data to generate insights that answer critical operational and business questions; 4) Evolve the pilots into a Data Management and Analytics Shared Service; and 5) Develop an Implementation Plan. The DoD CMO outlined its approach to Congress in December 2018. Strategy Elements:  Strategy Element #1: Define a Minimum Essential Set of Enterprise Data Tags that Enable the Tenets of DoDI 8320.07  Strategy Element #2: Invest In and Maintain the Infrastructure Required to Make DoDs Data Visible, Accessible, Understandable, Trusted, and Interoperable"
            },
            "4": {
                "name": "Objective 5: Strengthen Collaboration",
                "description": "International Partnerships, and Allied Interoperability Objective Description: Coordinate efforts across the DoD, North Atlantic Treaty Organization (NATO), Allies, and other international partners to advance warfighting interoperability and coalition operations. Deepen C4 capability and information sharing. Maximize communications, export/sales, and other Security Cooperation activities with allied partner nations. The Mission Partner Environment (MPE) enables the DoD to collaborate, share information, and conduct operations with mission partners. MPE connects DoD with the whole of U.S. government, Federal, State, local, and tribal government entities, allies, non-governmental organizations, treaty and private sector organizations, and territorial mission partners on a global scale, and supports the full range of military operations, including humanitarian assistance and disaster relief. All Combatant Commands (CCMD) require network interoperability with mission partners to optimize cooperation with a multi-national force. MPE will enable rapid formation of Communities of Interest (COIs) through all phases of military operations and for training and exercises. MPE will provide mission partners access to a set of core services and operational tools for modernized mission execution. Strategy Elements:  Strategy Element #1: Develop Military Satellite Communications (MILSATCOM) Services, Infrastructure, and Standards with International Partners  Strategy Element #2: Improve Tactical Communications Waveform Export Processes and Develop a Standardized Method to Address CCMD Connection Requests between US and Allied/Coalition Systems  Strategy Element #3: Advance Civil Emergency Communications Planning with DoD, NATO, Allies, and Other International Partners  Strategy Element #4: Ensure End-to-End Identity, Credential, and Access Management (ICAM) Interoperability with Key Interagency and International Partners at Appropriate Assurance Levels for the Information Being Shared  Strategy Element #5: Develop Flexible and Robust Secure Cryptographic Products for Seamless Secure Foreign Partner Interoperability  Strategy Element #6: Streamline Release Processes and Decision-making to Advance U.S. Security Cooperation  Strategy Element #7: Implement the MPE Requirements and Portfolio Management Processes  Strategy Element #8: Rationalize Coalition C2 and Intelligence Information Sharing Capabilities  Strategy Element #9: Deliver the DoD MPE Capability and Services"
            },
            "5": {
                "name": "Objective 6: Ensure National Leadership Command Capabilities (NLCC) Assured Connectivity Objective Description",
                "description": "The NLCC will provide diverse, accurate, integrated, survivable, secure, and timely assured communication pathways that allow national leadership to execute national and military command responsibilities. Strategy Elements:  Strategy Element #1: Evaluate Current Conferencing Capability and If Required, Develop a Methodology that Improves Secure, Survivable Conferencing  Strategy Element #2: Enhance Current Data Collection and Display Processes to Provide Senior Leadership-Quality Decision-Making Information  Strategy Element #3: Develop a Process that Delivers a Classified, Secure, and Mobile Solution that Meets Senior Leadership Requirements  Strategy Element #4: Enhance the Security of the Supply Chain for Continuity of Operations, Continuity of Government, and Senior Leader Command, Control, and Communications System (SLC3S) Communications Programs"
            },
            "6": {
                "name": "Objective 7: Enhance the Delivery and Protection of Positioning",
                "description": "Navigation, and Timing (PNT) Objective Description: Ensure positioning, navigation, and timing (PNT) availability and access. Precision strike, navigation, and network synchronization are dependent on the accuracy and dissemination of PNT signals predominantly provided at the present time by the Global Positioning System (GPS) and terrestrial atomic clocks. Improving the capability of the Joint Force (and Allies as appropriate) to operate in a GPS-denied or GPS-degraded environment requires a two-pronged effort: 1) decrease reliance on GPS-centric solutions by using Modular Open Systems Approaches (MOSA) to incorporate promising alternative/complementary PNT capabilities into Joint Force PNT devices; and 2) As improvements become operationally available, increase military GPS resilience by incorporating modernized GPS satellite, control, and user equipment capabilities. The strategy elements within this objective support all three Department strategic goals: Increase Lethality, Develop Alliances, and Reform Business Practices. Strategy Elements:  Strategy Element #1: Pursue DoD Implementation of a Modular Open Systems Approaches and Collaborative Modeling and Simulation (M&S) Approach for PNT Capabilities  Strategy Element #2: Develop and Publish the DoD PNT Science and Technology (S&T) Roadmap in Coordination with the Under Secretary of Defense for Research and Engineering (USD(R&E))  Strategy Element #3: Track and Assist in Modifying Plans for Military GPS User Equipment (MGUE) Development and Production  Strategy Element #4: Field Modernized PNT Capabilities with the Air Force and Our International Allies  Strategy Element #5: Develop Navigation Warfare (NAVWAR) Partnerships with Closely Allied Nations  Strategy Element #6: Evaluate and Demonstrate Complementary PNT Capabilities to Support Domestic Critical Infrastructure in Cooperation with Civilian Agencies (Department of Transportation (DOT) and Department of Homeland Security (DHS))  Strategy Element #7: Exercise the DoD PNT Enterprise Oversight Council, Executive Management Board, and Supporting Working Groups, To Ensure the DoD PNT Enterprise Provides a Military PNT Advantage to the Warfighter  Strategy Element #8: Develop New (and Maintain Existing) DoD Issuances to Facilitate Policy Implementation and Ensure DoD Component Compliance for the DoD PNT Enterprise  Strategy Element #9: Continue to Institutionalize the PNT Data Repository Data Collection Process"
            },
            "7": {
                "name": "Objective 8: Modernize Defense Information Systems Network (DISN) Transport Infrastructure Objective Description",
                "description": "The promised benefits from cloud computing, big data analytics, mobility, IoT, increased automation, and cognitive computing can only be fully realized with a suitable network. Modernization of the DISN is necessary to improve performance, capability, capacity, agility, and security, while reducing cost and complexity. Greatly enhanced bandwidth capacity and increased network resiliency support use of DoD-wide services and consolidation of critical IT systems, applications, and services from local installations to core data centers and the DoD enterprise cloud environment. Convergence on Everything over Internet Protocol (EoIP) and demand for information services, such as streaming video and real-time collaboration capabilities, are further driving transport infrastructure bandwidth capacity and Quality of Service requirements. Modernization initiatives underway will drastically reduce the number of network connections needed at any given Base/Post/Camp/Station (B/P/C/S) by consolidating to an all-IP infrastructure sharing a common network connection that can be virtualized for specific mission needs and cybersecurity protection. Significant efficiencies will be gained by migrating to a standardized set of protocols and network connection types, requiring fewer hardware types to operate, maintain, and refresh. The Joint Regional Security Stack (JRSS) improves mid-point network security, reduces attack surface, and improves situational awareness. Furthermore, it provides failover, diversity, mitigation, and resilient cybersecurity capabilities as a means to assure timely delivery of critical information to warfighters around the globe. Strategy Elements:  Strategy Element #1: Upgrade Optical Transport  Strategy Element #2: Enhance Mid-Point Security by Implementing JRSS and Joint Management System (JMS)  Strategy Element #3: Build Out Multi-Protocol Label Switching (MPLS) Router Network with Quality of Service and Performance Monitoring  Strategy Element #4: Implement Software Defined Networking (SDN)  Strategy Element #5: Eliminate Asynchronous Transfer Mode (ATM) and Low Speed Time Division Multiplexed (TDM) Circuits  Strategy Element #6: Implement Internet Protocol version 6 (IPv6)"
            },
            "8": {
                "name": "Objective 9: Modernize and Optimize DoD Component Networks and Services Objective Description",
                "description": "In order to achieve a modernized and effective force, the Department needs to consolidate and streamline capability delivery to support an evolving mission environment. The Department requires a secure, consistent, and cost efficient network to conduct operations and business functions. Modernization of the DoD IT infrastructure requires a focus on network and service optimization that converges DoD networks, Service Desks, and Network/Service Operation Centers into a consolidated, secure, and effective environment capable of addressing current and future mission objectives. Standardizing and modernizing the IT infrastructure and services eliminates unnecessary systems and allows the Department to focus finite resources across fewer areas, ultimately shrinking the Department's threat surface in cyberspace. Additionally, this convergence should yield reduced facility utilization. The initial phase of this effort includes Fourth Estate organizations, with the objective to reduce the number of networking environments, move to a single service provider, and size the number of Network Operations Centers/Security Operations Centers (NOCs/SOCs) for greatest efficiency and effectiveness. Strategy Elements:  Strategy Element #1: Consolidate and Optimize Fourth Estate Networks  Strategy Element #2: Consolidate the Number of Fourth Estate Service Desks into a Single Service Support Environment  Strategy Element #3: Consolidate and Optimize the Fourth Estate Network Operation Centers/Security Operations Centers (NOCs/SOCs)  Strategy Element #4: Establish Best Practices for Component Use of Commercial Service Providers in Their Optimization and Modernization Efforts"
            },
            "9": {
                "name": "Objective 10: Provide End-to-End Airborne Intelligence",
                "description": "Surveillance, and Reconnaissance (AISR) Data Transport (DT) Objective Description: Develop programmed capabilities and non-material processes to provide end-to-end AISR DT capabilities to globally dispersed strategic, operational, and tactical consumers (DoD and mission partners) at the time, place, quantity, and quality they require. AISR DT capabilities are defined as the signal transmission systems and processes required to move data from airborne platforms to required data consumers at the point of need. In support of Joint Requirements Oversight Council (JROC) tasking,5 DoD has established an AISR DT executive steering function and a joint Integration Task Force to provide direction for development of AISR transport capabilities and processes throughout the systems development lifecycle. Strategy Elements:  Strategy Element #1: Establish Capabilities to Support Ingest, Accumulation, and Global Delivery of AISR Data from Multiple Platforms/Sources  Strategy Element #2: Build Tactical Relays for Sensor Platform Connectivity to Local Users and the DISN  Strategy Element #3: Provide Global Satellite Gateways for Direct Beyond Line of Sight (BLOS) Connectivity Between AISR Platforms and the DISN  Strategy Element #4: Establish Network Operations to Support End-to-End Situational Awareness and Proactive Network Management  Strategy Element #5: Provide Direction for Future Platform Transport Capabilities"
            },
            "10": {
                "name": "Objective 11: Improve Information Sharing to Mobile Users Objective Description",
                "description": "The ongoing evolution of computing technology to mobile devices offers unprecedented opportunities to advance the operational effectiveness of the DoD. Through faster access to information and computing power from any location, field units will be able to maneuver in unfamiliar environments with real-time mapping and data overlay capabilities; friendly forces will be identified with greater accuracy; engineers and technicians will have streamlined identification and ordering of mechanical parts; and military healthcare providers will be able to better diagnose injuries and remotely access lab results while away from hospital premises. Additionally, by enabling real-time access to important management and productivity tools (e.g., e-mail, collaboration), warfighter support functions will be able to more effectively manage the business of the DoD. The end result of enhanced enterprise mobility will be:  Increased availability and use of secure, mobile, wireless platforms across the Departmentincluding within D-DIL circumstances  Access to multiple classification levels of plug and play using authorized government devices with minimal configuration Strategy Elements:  Strategy Element #1: Streamline the Purchasing of Mobile Devices and Services across the DoD Enterprise  Strategy Element #2: Improve Mobile Policies, Processes, and Procedures to Ensure Efficient and Effective Portfolio Management  Strategy Element #3: Expand Use of Derived Credentials for Mobile  Strategy Element #4: Develop Applications of Tactical Mobility  Strategy Element #5: Establish a Mobile Device Security Architecture and Risk Management Approach in Collaboration with Five Eyes (FVEY) Mission Partners  Strategy Element #6: Establish DoD Way-Ahead, Policy, and Plans for Use of the National First Responder Network (FirstNet) in Support of DoD Public Safety Communications  Strategy Element #7: DoD Will Be an Early Adopter of 5G and Develop Applications to Leverage 5G Advanced Capabilities"
            },
            "11": {
                "name": "Objective 12: Evolve the DoD to Agile Electromagnetic Spectrum Operations (EMSO) Objective Description",
                "description": "Develop a resilient, secure, and adaptive tactical IT infrastructure capable of operating within a contested, congested, and operationally limited EMS environment for Joint EMSO sensing, planning, management, and execution in order to enable U.S. dominance in all warfighting domains. DoD CIO will collaborate with DoD Components (e.g., OUSD(R&E), MILDEPS, Combatant Commands) to support achievement of this objective. Strategy Elements:  Strategy Element #1: Establish an EMSO Multi-Tiered Architecture Capable of Sharing EMS Data Between All Services and Agencies at All Classification Levels  Strategy Element #2: Establish a Resilient, Secure, and Adaptive EMSO IT Network Infrastructure"
            },
            "12": {
                "name": "Objective 13: Drive Standards into DoD IT Systems Objective Description",
                "description": "As required by Section 909 of the NDAA for FY2018, the DoD CIO will lead development, implementation, and enforcement of an IT, networking, and cybersecurity standards process for the Department. DoD CIO will collaborate with Department stakeholders, such as OUSD(A&S), OUSD(R&E), and Joint Staff, in assessment and revision of the current processes, governance, policy, and standards. As part of this process, guidance for leveraging North Atlantic Treaty Organization (NATO) Standardization Agreements (STANAGs), as well as commercial and governmental standards, will be provided. A critical desired outcome of this overall effort is increased interoperability. The DoD CIO envisions opportunities for synergy between compliance with standards and the Departments overall digital modernization efforts. Strategy Elements:  Strategy Element #1: Assess and Identify Gaps in Policy for IT, Networking, Data, and Cybersecurity Standards  Strategy Element #2: Develop Strategy for Addressing Gaps in Processes, Governance, Policy, and Standards  Strategy Element #3: Implement Revised Processes, Governance, Policy, and Standards  Strategy Element #4: Monitor and Enforce Compliance with Revised Processes, Governance, Policy, and Standards"
            }
        }
    },
    "1": {
        "name": [
            "Optimize for Efficiencies and Improved Capability"
        ],
        "description": "Delivering IT capabilities with greater efficiency and performance requires the Department to reform the way it operates In particular the evaluation and implementation of suitable industry best current practices and proven technologies must be greatly accelerated and oversight of IT spending must be improved The objectives in this goal include shifting to an enterprisewide operations and defense model rightsizing DoD data centers optimizing office productivity and collaboration capabilities optimizing voice and video capabilities improving purchasing through enterprise agreements strengthening partnerships with industry and strengthening IT financial management and accountability",
        "objectives": {
            "0": {
                "name": "Objective 1: Shift from Component-Centric to Enterprise-Wide Operations and Defense Model Objective Description",
                "description": "Shifting from Component Centric to Enterprise Network Operations will provide the capabilities necessary to enable operations centersresponsible for executing DODIN Operations and Defensive Cyber Operations-Internal Defense Measures (DCO-IDM) activitiesto more effectively and efficiently secure, operate, and defend the DODIN. The vision is to ensure that DoD military commanders, civilian leadership, warfighters, coalition partners, and other authorized non-DoD mission partners have access to information and data provided in a secure, reliable, and agile DoD-wide information environment to enable C2 of forces performing cyberspace operations. The JIE Management Network enables operations centers to securely manage the DODIN and its elements. A fully converged DODIN IT Service Management solution is envisioned to support change management, configuration management, asset management, knowledge management, and service level management. Strategy Elements:  Strategy Element #1: Enable Global and Regional Operations Centers  Strategy Element #2: Establish and Implement the JIE Management Network for JRSS  Strategy Element #3: Converge DODIN IT Service Management (ITSM) Solutions  Strategy Element #4: Converge DODIN Operation Common Operation Picture (COP) Solutions"
            },
            "1": {
                "name": "Objective 2: Optimize DoD Data Centers Objective Description",
                "description": "In accordance with Federal guidance, 6 DoD is optimizing the Department's data center facility footprint and the management and operation of those facilities. Ultimately, DoD's Information Enterprise will consist of a streamlined number of data centers that effectively and efficiently meet DoD's broad range of missionsfrom recruiting to acquisition management to command and control. As part of the optimization process, Installation Processing Nodes must be re-designated as Closing, an Installation Service Node, a Special Purpose Processing Node, or a Component Enterprise Data Center. The re-designation will be driven by an assessment of the systems and applications (if any) which must remain. DoD will migrate applications and systems to select data centers; optimize select data centers for performance first, then cost; and consolidate data centers where practical.6 Federal data center optimization policy is available at: https://datacenters.cio.gov/policy/ Strategy Elements:  Strategy Element #1: Migrate DoD Applications and Systems that Cannot be Hosted in Commercial Cloud Environments to Enterprise Data Centers  Strategy Element #2: Optimize Select Data Centers for Performance First, Then Cost  Strategy Element #3: Re-designate Installation Processing Nodes in Accordance with the Department's Current Data Center Optimization Approach  Strategy Element #4: Manage the DoD Data Center Inventory for Mission Need"
            },
            "2": {
                "name": "Objective 3: Optimize DoD Office Productivity and Collaboration Capabilities (ECAPS Capability Set 1) Objective Description",
                "description": "DoD's cloud strategy is a main component in the overall efforts to modernize the Department's information technology, with the objective of achieving a Department-wide enterprise cloud computing ecosystem. As an integral part of that strategy, the Defense Enterprise Office Solution (DEOS) will enable the Department to improve interoperability and enhance cybersecurity across DoD operational boundaries. DEOS will put collaboration and productivity capabilities in the hands of every DoD employee and warfighter to more effectively and efficiently accomplish their missions. DEOS will offer an interoperable solution for timely and seamless collaboration and information-sharing across operational boundaries and including D-DIL environments. DEOS is the first capability set solution within the DoD Enterprise Collaboration and Productivity Services (ECAPS) portfolio. Strategy Elements:  Strategy Element #1: Designate DEOS as a DoD Enterprise Service with all DoD Components Required to Adopt  Strategy Element #2: Monitor and Assess All Pilots for Implementation Pitfalls and Challenges, including D-DIL; Roll All Lessons Learned from Early Cloud Adopters into DEOS  Strategy Element #3: Field DEOS (including in D-DIL Environments) and Complete Migration of All DoD Users"
            },
            "3": {
                "name": "Objective 4: Optimize DoD Voice and Video Capabilities (ECAPS Capability Sets 2 ",
                "description": "3) Objective Description: Modernizing existing voice and video capabilities is critical for the Department to achieve integrated and seamless DoD-wide communication in an effective and financially sound way. Existing DoD voice and video services are largely outdated. They include a mix of obsolete circuit-based switch systems and video technology reliant on non-IP transport that is being phased out by commercial carriers. Eliminating these systems and transitioning to an integrated IP environment across Components will allow DoD to: 1) Optimize voice and video service, and 2) Effectively manage operating costs as commercial carriers escalate sustainment costs for remaining non-IP service. The DoD will also close a significant operational gap in current 9-1-1 capabilities and enhance force protection with the implementation of the Next-Generation 9-1-1 (NG911) national standard. Once implemented, that standard will operate on IP-enabled emergency networksallowing constituents on DoD installations to make a 9-1-1 call from any communication device in any mode (e.g., voice, text, or video)and provide interoperability with civilian mission partners. Strategy Elements:  Strategy Element #1: Define and Deploy an Optimized Enterprise Voice and Video Solution across the Department (e.g., ECAPS Capability Sets 2 and 3)  Strategy Element #2: Define and Deploy an Optimized DoD C2 Voice Solution  Strategy Element #3: Eliminate DoDs Legacy Analog Phone Switch Infrastructure  Strategy Element #4: Establish DoD Way-Ahead, Policy, and Plans for Employment of Next Generation 9-1-1 (NG911)"
            },
            "4": {
                "name": "Objective 5: Improve IT Category Management Objective Description",
                "description": "Category management is an approach the Federal Government is applying to eliminate redundancies, increase efficiency, and deliver savings from acquisition programs. DoD is aligning its IT Category Management with the Federal IT Category Management efforts by pursuing strategic sourcing (e.g., enterprise license agreements (ELA)) for the acquisition of commercial IT software, hardware, services, and telecommunications. DoDs IT Category Management is designed to save time and money by leveraging commercial IT requirements across DoD Components to negotiate more favorable terms in purchasing agreements and maximize discounts through enterprise volume purchasing solutions. The result of IT Category Management will be:  Decreased procurement overhead costs by reducing the number of duplicative commercial IT purchasing vehicles  Reduced procurement costs by consolidating orders for common commercial IT  Lower unit costs for common commercial IT goods and services by maximizing discounts through enterprise purchasing solutions  Reduced costs of procuring and maintaining underutilized IT assets by improving asset visibility to reduce excess inventories  Improved IT contract and license terms and conditions by using a qualified IT acquisition workforce to align enterprise agreements with DoD requirements  Utilization of enterprise acquisition vehicles that enable the DoD to leverage economies of scale  Improved product support services by including terms for minimum service levels for applicable commercial support services in enterprise agreements Strategy Elements:  Strategy Element #1: Continue to Establish ELAs for IT Software, Hardware, Services, and Telecommunications  Strategy Element #2: Expand ELAs to Address Other IT Categories (e.g., IT Security) Based on OMB Guidance  Strategy Element #3: Establish DoD Category Management Policy  Strategy Element #4: Implement DoD IT Asset Management"
            },
            "5": {
                "name": "Objective 6: Improve Rapid Technology Deployment Processes Objective Description",
                "description": "One persistent challenge for DoD has been that acquisition processes have kept the Department from being able to adopt new technology in a timely manner. DoD will bring new technology in house much faster through three approaches: streamlining the technology approval process, leveraging innovative technology development practices such as Digital Engineering, and leveraging approved processes such as Other Transactional Agreements (OTAs). All of these approaches will enable the Department to reap the benefits of greater efficiency and security. Strategy Elements:  Strategy Element #1: Streamline the Technology Approval Process  Strategy Element #2: Leverage the Power and Agility of Other Transactional Agreements (OTAs)"
            },
            "6": {
                "name": "Objective 7: Strengthen IT Financial Management Decision Making and Accountability Objective Description",
                "description": "The Component Financial Improvement Plans (FIPs), when summarized collectively, compose the Department's Financial Improvement and Audit Readiness (FIAR) Plan. The DoD Components' FIPs are prepared and executed in accordance with FIAR Guidance issued by the Office of the Under Secretary of Defense (Comptroller) (OUSD(C)). The FIAR Guidance provides the strategy and standard methodology, as well as the step-by-step approach for discovery and evaluation; documenting, testing, and strengthening controls; and achieving an audit ready systems environment. Existing and future systems will need to satisfy joint general and application level control requirements identified in the FIAR Guidance and the Federal Information System Controls Audit Manual (FISCAM). In addition, Departmental investments made in Internal Use Software, purchased (Commercial Off the Shelf (COTS)) or internally developed, must be accounted for in a manner that addresses financial statement auditability requirements. To strengthen IT financial management and oversight, the FY2018 NDAA requires the DoD CIO to review each military departments and each Defense Agencys proposed budget against the responsibilities outlined in Title 10 USC 142(b) paragraph (1) and submit to the Secretary of Defense a report containing the comments of the CIO with respect to all such proposed budgets, together with the certification of the CIO regarding whether each proposed budget is adequate. Strategy Elements:  Strategy Element #1: Support Audit Readiness for Financial and Mixed Systems that Impact Financial Reporting  Strategy Element #2: Improve Accountability and Auditability for Internal Use Software Investments  Strategy Element #3: Implement FY2018 NDAA Requirements Regarding Oversight and Certification of Component IT Budgets"
            }
        }
    },
    "2": {
        "name": [
            "Evolve Cybersecurity for an Agile and Resilient Defense Posture"
        ],
        "description": "The scope pace and sophistication of malicious cyberspace activity continues to rise globally Growing dependence on the cyberspace domain for nearly every essential civilian and military function makes this an urgent issue that must be addressed DoD overmatch in conventional and strategic weaponry may be overcome through sophisticated attacks within cyberspace supply chain exploitation across the acquisition and sustainment lifecycle and intelligence operations targeting insiders with access The Department must adopt a Cyber First Cyber Always7 mindset and be prepared to defend DoD systems in a contested cyberspace Every network system application and enterprise service must be secure by design with cybersecurity managed throughout the acquisition lifecycle The Department will maintain 7 This phrase was used by the DoD CIO in his speech at the Billington Cybersecurity Summit on 6 September 2018 system confidentiality integrity and availability by defending against avenues of attack used by sophisticated adversaries",
        "objectives": {
            "0": {
                "name": "Objective 1: Transform the DoD Cybersecurity Architecture to Increase Agility and Strengthen Resilience Objective Description",
                "description": "The Departments approach to cybersecurity is documented in the DoD Cybersecurity Reference Architecture (CSRA), which guides and constrains how network boundaries, mobile and fixed end points, and data are protected. The DoD CSRA is developed in collaboration with DoD Component stakeholders (e.g., OUSD(R&E), DISA, NSA, MILDEPS, Combatant Commands). It reflects key cybersecurity principles: isolation, containment, redundancy, layers of defense, least privilege, situational awareness, and physical/logical segmentation of networks, services, and applications. The resulting protections contribute to a resilient defense posture and achievement of three cybersecurity objectives:  The DODINto include the data on the networkis defended as a virtual single information environment through the use of common processes and capabilities.  Cyberspace-defenses sense and respond to external and internal threats and take appropriate remediation. mitigation. and restoration actions.  Command and control of forces that operate on the DODIN is supported by shared cybersecurity situational awareness of the network as a whole. IT security findings are shared and reused throughout the Department to the greatest extent practical. Strategy Elements:  Strategy Element #1: Improve Endpoint Security and Continuous Monitoring  Strategy Element #2: Enhance Enterprise Perimeter Protection Capabilities  Strategy Element #3: Establish Enterprise Comply-to-Connect Capability  Strategy Element #4: Deploy Insider Threat Detection Capabilities  Strategy Element #5: Strengthen Data Center Security  Strategy Element #6: Standardize on Windows 10 Secure Host Baseline (SHB)  Strategy Element #7: Implement Automated Patch Management  Strategy Element #8: Enhance Cybersecurity Situational Awareness through Big Data Analytics  Strategy Element #9: Modernize the Cryptographic Inventory and Supporting Infrastructure  Strategy Element #10: Incorporate Cloud-Native Capabilities into Defensive Cyberspace Operations"
            },
            "1": {
                "name": "Objective 2: Deploy an End-to-End Identity",
                "description": "Credential, and Access Management (ICAM) Infrastructure Objective Description: DoD must promote implementation of enterprise ICAM to support rapid access to mission information, strengthen responsible information sharing and attribution with allies and partners, and support greater effectiveness and efficiency through mobile adoption and migration to the cloud. ICAM encompasses the full range of activities related to creation of digital identities and maintenance of associated attributes, credential issuance for person/non-person entities, authentication using the credentials, and making access management control decisions based on authenticated identities and associated attributes. ICAM creates a secure and trusted environment where any user can access all authorized resources (including applications and data) to have a successful mission, while also letting DoD know who is on the network at any given time. Among its benefits, ICAM also supports correction of weaknesses reported in the notification of findings and recommendations (NFR) from the 2018 defense-wide financial audit. Strategy Elements:  Strategy Element #1: Expand Public Key Enablement Capabilities to Support ICAM  Strategy Element #2: Implement Automated Account Provisioning  Strategy Element #3: Implement Support for Approved Multi-Factor Authentication Capabilities  Strategy Element #4: Enhance Enterprise Identity Attribute Service (EIAS)  Strategy Element #5: Expand the Use of Derived Credentials  Strategy Element #6: Implement a Data Centric Approach to Collect, Verify, Maintain, and Share Identity and Other Attributes  Strategy Element #7: Improve and Enable Authentication to DoD Networks and Resources through Common Standards, Shared Services, and Federation  Strategy Element #8: Deploy Shared Services Promoting the Implementation of Enterprise ICAM  Strategy Element #9: Enable Consistent Monitoring and Logging to Support Identity Analytics for Detecting Insider Threats and External Attacks  Strategy Element #10: Enhance the Governance Structure Promoting the Development and Adoption of Enterprise ICAM Solutions  Strategy Element #11: Create DoD Policies and Standards Clearly Defining Requirements for Identification, Credentialing, Authentication, and Authorization Lifecycle Management"
            },
            "2": {
                "name": "Objective 3: Protect Sensitive DoD Information and Critical Programs and Technologies on Defense Industrial Base (DIB) Unclassified Networks and Information Systems Objective Description",
                "description": "DoD relies on the Defense Industrial Base to develop advanced technologies and warfighting capabilities. Adversaries exploit DIB unclassified internal networks and information systems, stealing sensitive information in order to kill, counter, or clone DoDs warfighting capabilities before they are delivered to DoD. To improve the safeguarding of this information, DoD CIO, OUSD(A&S), OUSD(R&E), the Principal Cyber Advisor, and other stakeholders are collaborating on a multipronged approach that incorporates voluntary cyberspace threat information sharing, mandatory cybersecurity standards for defense contractor unclassified internal information systems and networks, and cybersecurity reporting of incidents that affect DoD controlled unclassified information on defense contractor unclassified internal information systems and networks. DoD CIO is a key stakeholder in the implementation of the Defense Federal Acquisition Regulation Supplement (DFARS) 252.204-7012, Safeguarding Covered Defense Information and Cyber Incident Reporting requiring industry to implement adequate security for their information systems that process DoD controlled unclassified information, including at a minimum the security requirements in National Institute of Standards and Technology (NIST) Special Publication (SP) 800-171, Protecting Controlled Unclassified Information in Nonfederal Systems and Organizations. DoD CIO also oversees the DIB Cybersecurity (CS) Program. The DIB CS Program is DoDs public-private cybersecurity threat collaboration partnership through which classified and unclassified cybersecurity threat information is shared with DIB participants. The DoD Cyber Crime Center (DC3) is the operational focal point for the program, analyzing cybersecurity threats, developing a common operational threat picture, and sharing mitigations with industry, DoD, and interagency partners. DC3 is also the designated single DoD focal point for receiving all cybersecurity incident reporting affecting unclassified networks of DoD contractors from industry and other government agencies. OUSD(A&S) is utilizing pathfinders to assure DIB cybersecurity requirements and expand cybersecurity threat information sharing to non-cleared defense contractors. These pathfinders will examine (1) a standard cybersecurity maturity model certification for DIB companies, (2) external cybersecurity validation of DIB companies with on-premise Controlled Unclassified Information (CUI) data through commercial 3rd party companies, and (3) internal cybersecurity validation of DIB company volunteers with off-premise CUI data in commercial clouds through FFRDC and UARC partners. Strategy Elements:  Strategy Element #1: Support Development of Consistent Procedures to Assess Contractor Compliance with Cybersecurity Requirements  Strategy Element #2: Support Efforts to Update NIST SP 800-171 to Address Advanced Persistent Threats  Strategy Element #3: Increase Participation in the DIB Cybersecurity Program  Strategy Element #4: Expand Cybersecurity Threat Information Sharing to Non-Cleared Defense Contractors  Strategy Element #5: Plan and Execute DIB Cybersecurity Pathfinders"
            },
            "3": {
                "name": "Objective 4: Reform DoD Cybersecurity Risk Management Policies and Practices Objective Description",
                "description": "DoD will reform its cybersecurity risk management policies and practices to be more effective, yet responsive to the needs of the warfighter. DoDs risk management approach requires prioritizing critical systems and assets; identifying and mapping mission risks; and tailoring cybersecurity implementation to mission dependencies. Furthermore, increasing dependence on commercial technologies and services (e.g. commodity IT, Industrial Control Systems, cloud services), coupled with the interdependent nature of cyberspace, requires more robust engagement to increase international cooperation, pro-actively shape standards, expand the use of software and hardware assurance methods, and address global supply chain risks. Finally, the DoD Risk Management Framework process will be reformed to improve effectiveness and efficiency, while ensuring it does not unnecessarily hinder the development and deployment of systems supporting the warfighter. Strategy Elements:  Strategy Element #1: Advance Risk Management Framework Reform to Ensure it is More Efficient and Adaptable  Strategy Element #2: Ensure Cybersecurity Risks are Planned for and Managed Throughout the Acquisition Lifecycle  Strategy Element #3: Enhance Processes to Address Enterprise-Wide Supply Chain Risks  Strategy Element #4: Strengthen the DoD Cybersecurity Portfolio Management Process  Strategy Element #5: Expand the Use of Proven Software and Hardware Assurance Methods  Strategy Element #6: Build and Maintain Robust International Cybersecurity Cooperation Efforts  Strategy Element #7: Increase DoD Participation in Setting Federal Government and International Commercial Cybersecurity Standards"
            }
        }
    },
    "3": {
        "name": [
            "Cultivate Talent for a Ready Digital Workforce"
        ],
        "description": "Competition for high quality experienced digital workforce personnel is constant and increasingly aggressive The Department of Defense is one of the three largest markets for this talent in the United States due to its size its continuous adoption and adaptation of technology and its extensive mission requirements Critical national infrastructure protection in particular is a global growth industry DoD is executing a new Functional Community Maturity Model for management of DoD civilians The DoD CIO will implement this model for elements of the Cyber Workforce and expand implementation of more agile recruiting training and retention capabilities through expansion of the Cyber Excepted Service personnel system incentives and local supplements Work continues on development of baseline qualification requirements for over 50 cyber work roles This will provide the workforce with a common understanding of the concepts principles and applications of cyberspace functions to enhance interoperability across organizational lines and mission sets",
        "objectives": {
            "0": {
                "name": "Objective 1: Strengthen Cyber Functional Community Management Objective Description",
                "description": "Improve business practices to promote strategic management and development of the civilian cyber workforce. Strategy Elements:  Strategy Element #1: Implement the Functional Community Maturity Model for the IT and Cybersecurity Categories of the Cyber Workforce  Strategy Element #2: Identify and Target Work Role Gaps of Critical Need for the Cyber (IT and Cybersecurity) Workforce"
            },
            "1": {
                "name": "Objective 2: Strengthen the IT Acquisition Workforce Objective Description",
                "description": "Develop and sustain a cyber workforce cadre skilled in the application of strategic planning processes and agile acquisition capabilities for the attainment of secure technologies and software. Strategy Elements:  Strategy Element #1: Strengthen IT Acquisition Workforce Competencies  Strategy Element #2: Update Curriculum Requirements and Maintain Continuous Learning Capabilities"
            },
            "2": {
                "name": "Objective 3: Enhance Cyber Workforce Recruiting",
                "description": "Retention, Education, Training, and Professional Development Objective Description: In 2018, DoD commenced conversion to a new, more agile personnel program developed specifically for the Cyber Workforce. This program will continue to expand in functionality and scope as additional organizations and individuals convert to Cyber Excepted Service, providing hiring managers with greater options for sourcing candidates and the ability to offer more competitive compensation packages. A new Cyber Workforce Qualification Program is also under development which incorporates flexible attainment of credentials and performance-based assessments to achieve a DoD-wide standard baseline of cyberspace capabilities. Strategy Elements:  Strategy Element #1: Expand Implementation of Cyber Excepted Service  Strategy Element #2: Implement Cyber Workforce Qualifications Program"
            }
        }
    }
}